; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 439317 2 2 4 3 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph1 - mode
	image3 - mode
	image0 - mode
	thermograph2 - mode
	GroundStation2 - direction
	Star0 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 image3)
	(supports instrument2 image0)
	(calibration_target instrument2 Star1)
	(supports instrument3 image0)
	(supports instrument3 image3)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite1 Planet6)
	(have_image Star3 spectrograph1)
	(have_image Star4 thermograph2)
	(have_image Planet5 spectrograph1)
	(have_image Planet6 image3)
	(have_image Star7 spectrograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (turn_to satellite1 star1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star1)
   goals met: 0 of 6
4. (turn_to satellite0 star0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
5. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 6
6. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 6
7. (turn_to satellite1 planet6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet6)
   goals met: 1 of 6
8. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 1 of 6
9. (take_image satellite1 planet6 instrument2 image3)
   added: (have_image planet6 image3)
   goals met: 2 of 6
10. (take_image satellite0 star7 instrument1 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 3 of 6
11. (turn_to satellite0 star3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star3)
   goals met: 3 of 6
12. (take_image satellite0 star3 instrument1 spectrograph1)
   added: (have_image star3 spectrograph1)
   goals met: 4 of 6
13. (turn_to satellite0 planet5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet5)
   goals met: 4 of 6
14. (take_image satellite0 planet5 instrument1 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 5 of 6
15. (turn_to satellite0 star4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star4)
   goals met: 5 of 6
16. (take_image satellite0 star4 instrument1 thermograph2)
   added: (have_image star4 thermograph2)
   goals met: 6 of 6
